Repository: LancCJ/file-sync-monitor
Catalog: Sources/FileSyncMonitor/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 请在设置中配置 Tencent IMA 的 Client ID 和 API Key，以开启全自动云端同步备份。
en: Please configure Tencent IMA Client ID and API Key in Settings to enable fully automatic cloud sync backup.
zh_hant: 請在設置中配置 Tencent IMA 的 Client ID 和 API Key，以開啟全自動雲端同步備份。

source: 如何获取 Tencent IMA 凭证
en: How to get Tencent IMA credentials
zh_hant: 如何獲取 Tencent IMA 憑證

source: 登录并进入控制台
en: Log in & Enter Console
zh_hant: 登錄並進入控制台

source: 登录您的腾讯云账号，访问 Tencent IMA (腾讯云智能知识库) 平台并进入管理控制台。
en: Log in to your Tencent Cloud account, visit the Tencent IMA platform, and enter the management console.
zh_hant: 登錄您的騰訊雲賬號，訪問 Tencent IMA (騰訊雲智能知識庫) 平台並進入管理控制台。

source: 获取 API 密钥
en: Get API Keys
zh_hant: 獲取 API 密鑰

source: 在「API 密钥」或「安全凭证」管理页面，生成并获取您的 Client ID (客户端标识) 和 API Key (接口密钥)。
en: In the 'API Key' or 'Credentials' management page, generate and retrieve your Client ID and API Key.
zh_hant: 在「API 密鑰」或「安全憑證」管理頁面，生成並獲取您的 Client ID 和 API Key。

source: 获取知识库 ID
en: Get Knowledge Base ID
zh_hant: 獲取知識庫 ID

source: 在「知识库管理」中，选择或创建目标知识库，复制其知识库 ID 并填入同步目录设置中。
en: In 'Knowledge Base Management', select or create a target knowledge base, copy its ID, and paste it into monitored path settings.
zh_hant: 在「知識庫管理」中，選擇或創建目標知識庫，複製其知識庫 ID 並填入同步目錄設置中。

source: 获取凭证帮助
en: Credentials Help
zh_hant: 獲取憑證幫助

source: 了解如何注册并获取 Tencent IMA 凭证
en: Learn how to register and retrieve Tencent IMA credentials
zh_hant: 了解如何註冊並獲取 Tencent IMA 憑證

source: 查看帮助
en: View Help
zh_hant: 查看幫助

source: 我知道了
en: Got it

source: 云端同步配置未完成
en: Cloud Sync Incomplete
zh_hant: 雲端同步配置未完成

source: 请在设置中配置 Tencent IMA 的 Client ID、API Key 和 知识库 ID，以开启全自动云端同步备份。
en: Please configure Tencent IMA Client ID, API Key, and Knowledge Base ID in Settings to enable fully automatic cloud sync backup.
zh_hant: 請在設置中配置 Tencent IMA 的 Client ID、API Key 和 知識庫 ID，以開啟全自動雲端同步備份。

source: 去配置
en: Configure

source: 首页
en: Home
zh_hant: 首頁

source: 待同步
en: Pending Sync

source: 全部记录
en: All Records
zh_hant: 全部記錄

source: 报告
en: Reports
zh_hant: 報告

source: 设置
en: Settings
zh_hant: 設置

source: 帮助
en: Help
zh_hant: 幫助

source: 帮助与关于
en: Help & About
zh_hant: 幫助與关于

source: 解锁 FileSyncMonitor 的全部潜力，让您的工作流与 IMA 云端无缝合一。
en: Unlock the full potential of FileSyncMonitor and seamlessly integrate your workflow with IMA Cloud.
zh_hant: 解鎖 FileSyncMonitor 的全部潛力，讓您的工作流與 IMA 雲端無縫合一。

source: 实时智能监控
en: Intelligent Monitoring
zh_hant: 實時智能監控

source: 全天候变动捕获
en: 24/7 Change Capture
zh_hant: 全天候變動捕獲

source: 利用高性能 FSEvents 技术，秒级感知任何文件的新增、修改或重命名。
en: Using high-performance FSEvents technology to sense any file creation, modification, or renaming in seconds.
zh_hant: 利用高性能 FSEvents 技術，秒級感知任何文件的新增、修改或重命名。

source: 智能过滤引擎
en: Smart Filter Engine
zh_hant: 智能過濾引擎

source: 内置专业级忽略规则，自动屏蔽缓存与系统杂质，让您的监控列表始终保持纯净。
en: Built-in professional-grade ignore rules automatically block cache and system noise, keeping your monitor list clean.
zh_hant: 內置專業級忽略規則，自動屏蔽緩存与系統雜質，讓您的監控列表始終保持純潔。

source: IMA 双向同步
en: IMA Bidirectional Sync
zh_hant: IMA 雙向同步

source: 双向拉取与删除决策
en: Bidirectional Pull & Deletion Decision
zh_hant: 雙向拉取與刪除決策

source: 点击「从云端拉取更新」以合并云端更改。若本地已被删除的文件仍存于云端，会弹框提示您选择重新拉回或保持本地删除。
en: Click 'Pull from Cloud' to merge cloud changes. If locally deleted files still exist on the cloud, a dialog will ask whether you want to pull them back or keep them deleted.
zh_hant: 點擊「從雲端拉取更新」以合併雲端更改。若本地已被刪除的文件仍存於雲端，會彈框提示您選擇重新拉回或保持本地刪除。

source: 自动推送与删除同步
en: Auto Push & Deletion Sync
zh_hant: 自動推送與刪除同步

source: 开启自动同步后 30 秒自动完成云端备份。对于本地删除事件，应用会自动标记同步成功，并指引您手动清理云端以实现双向一致。
en: Auto backup completes 30 seconds after saving. For local deletion events, the app automatically marks them synced and guides you to manually clean the cloud for full consistency.
zh_hant: 開啟自動同步後 30 秒自動完成雲端備份。對於本地刪除事件，應用會自動標記同步成功，並指引您手動清理雲端以實現雙向一致。

source: 精品化交互体验
en: Premium UX Design
zh_hant: 精品化交互體驗

source: 极致视觉反馈
en: Visual Feedback
zh_hant: 極致視覺回馈

source: 每一处按钮与卡片都经过精心调校，支持细腻的悬停动效与平滑的状态转换。
en: Every button and card is carefully tuned, supporting subtle hover effects and smooth state transitions.
zh_hant: 每一處按鈕与卡片都經過精心調校，支持細膩的懸停動效与平滑的狀態轉換。

source: 秒级记录分析
en: Second-Level Analytics
zh_hant: 秒級記錄分析

source: 支持秒级精度的时间轴回溯，并提供专业级 CSV/JSON 报表导出。
en: Supports second-level precision timeline backtracking and provides professional CSV/JSON report export.
zh_hant: 支持秒級精度的時間軸回溯，並提供專業級 CSV/JSON 報表導出。

source: 搜索文件或路径
en: Search files or paths
zh_hant: 搜尋檔案或路徑

source: 全部同步至 IMA
en: Sync All to IMA

source: 从云端拉取更新
en: Pull Updates from Cloud
zh_hant: 從雲端拉取更新

source: 全部标记完成
en: Mark All Done
zh_hant: 全部標記完成

source: 监控目录
en: Watched Folders
zh_hant: 監控目錄

source: 忽略规则
en: Ignore Rules
zh_hant: 忽略規則

source: IMA 云端
en: IMA Cloud
zh_hant: IMA 雲端

source: 通知与导出
en: Notifications & Export
zh_hant: 通知與匯出

source: 版本
en: Version

source: 测试连接
en: Test Connection
zh_hant: 測試連線

source: 连接成功
en: Connected
zh_hant: 連接成功

source: 连接失败
en: Failed
zh_hant: 連接失敗

source: 全部
en: All

source: 新增
en: Created

source: 修改
en: Modified

source: 删除
en: Delete
zh_hant: 刪除

source: 重命名
en: Renamed
zh_hant: 重新命名

source: 同步状态
en: Sync Status
zh_hant: 同步狀態

source: 记录时间
en: Record Time
zh_hant: 記錄時間

source: 是否目录
en: Is Folder
zh_hant: 是否目錄

source: 已同步
en: Synced

source: 待同步_value
en: Pending
zh_hant: 待同步

source: 目录
en: Folder
zh_hant: 目錄

source: 文件
en: File

source: 今天
en: Today

source: 近 7 天
en: Last 7 Days

source: 近 30 天
en: Last 30 Days

source: 同步至知识库
en: Sync to Knowledge Base
zh_hant: 同步至知識庫

source: 默认 (新建笔记)
en: Default (New Note)
zh_hant: 預設（新建筆記）

source: 隐藏
en: Hide
zh_hant: 隱藏

source: 显示
en: Show
zh_hant: 顯示

source: 复制
en: Copy
zh_hant: 複製

source: 粘贴
en: Paste
zh_hant: 貼上

source: 未填写
en: Not set
zh_hant: 未填寫

source: 过滤 .DS_Store、临时文件、系统目录和常见构建缓存
en: Filters .DS_Store, temporary files, system folders, and common build caches.
zh_hant: 過濾 .DS_Store、暫存檔、系統目錄和常見建置快取

source: 永久
en: Forever

source: %lld 天
en: %lld Days

source: 跟随系统
en: System
zh_hant: 跟隨系統

source: 界面
en: Interface
zh_hant: 介面

source: 语言
en: Language
zh_hant: 語言

source: 手动指定界面语言或跟随系统
en: Manually choose the interface language or follow the system.
zh_hant: 手動指定介面語言或跟隨系統

source: 外观模式
en: Appearance
zh_hant: 外觀模式

source: 切换浅色、深色或跟随系统设置
en: Switch between light, dark, or system appearance.
zh_hant: 切換淺色、深色或跟隨系統設定

source: 简体中文
en: Simplified Chinese
zh_hant: 簡體中文

source: 繁体中文
en: Traditional Chinese
zh_hant: 繁體中文

source: 切换语言
en: Switch Language
zh_hant: 切換語言

source: 低频查看统计和导出记录。日常处理请回到待同步。
en: Use reports for occasional stats and exports. Handle daily work in Pending.
zh_hant: 低頻查看統計和匯出記錄。日常處理請回到待同步。

source: 确定退出 FileSyncMonitor？
en: Quit FileSyncMonitor?
zh_hant: 確定退出 FileSyncMonitor？

source: 退出后将停止监控文件变动和自动同步。
en: Monitoring and auto sync will stop after quitting.
zh_hant: 退出後將停止監控檔案變動和自動同步。

source: 退出
en: Quit

source: 取消
en: Cancel

source: 添加一个目录后，文件变动会自动记录并提醒你处理。
en: Add a folder and file changes will be recorded automatically for review.
zh_hant: 新增一個目錄後，檔案變動會自動記錄並提醒你處理。

source: 所有文件变动都已处理完成。
en: All file changes have been handled.
zh_hant: 所有檔案變動都已處理完成。

source: 有新的文件变动等待确认同步。
en: New file changes are waiting for sync confirmation.
zh_hant: 有新的檔案變動等待確認同步。

source: 全部同步
en: Sync All

source: 添加目录
en: Add Folder
zh_hant: 添加目錄

source: 处理待同步
en: Handle Pending
zh_hant: 處理待同步

source: 查看全部记录
en: View All Records
zh_hant: 查看全部記錄

source: 查看报告
en: View Reports
zh_hant: 查看報告

source: 最近记录
en: Recent Records
zh_hant: 最近記錄

source: 添加监控目录后，文件变动会显示在这里。
en: File changes will appear here after you add a monitored folder.
zh_hant: 新增監控目錄後，檔案變動會顯示在這裡。

source: 最近捕获到的文件变动。
en: Recently captured file changes.
zh_hant: 最近捕獲到的檔案變動。

source: 暂无记录
en: No Records
zh_hant: 暫無記錄

source: 开始监控后，这里会显示最新文件变动。
en: Latest file changes will appear here once monitoring starts.
zh_hant: 開始監控後，這裡會顯示最新檔案變動。

source: 当前状态
en: Current Status
zh_hant: 目前狀態

source: 快速了解监控与同步状态。
en: A quick view of monitoring and sync status.
zh_hant: 快速了解監控與同步狀態。

source: 同步队列
en: Sync Queue
zh_hant: 同步佇列

source: 没有待同步文件
en: No pending files
zh_hant: 沒有待同步檔案

source: 同步模式
en: Sync Mode

source: 自动同步
en: Auto Sync
zh_hant: 自動同步

source: 手动同步
en: Manual Sync
zh_hant: 手動同步

source: 稳定 30 秒后上传
en: Upload after 30 seconds stable
zh_hant: 穩定 30 秒後上傳

source: 点击按钮时上传
en: Upload when clicked
zh_hant: 點擊按鈕時上傳

source: 尚未添加
en: Not added

source: 记录总数
en: Total Records
zh_hant: 記錄總數

source: 所有变动都处理完成了。
en: All changes have been handled.
zh_hant: 所有變動都處理完成了。

source: 添加目录后记录会显示在这里。
en: Records will appear here after you add a folder.
zh_hant: 新增目錄後記錄會顯示在這裡。

source: 所有文件都已同步
en: All files are synced
zh_hant: 所有檔案都已同步

source: 还没有文件记录
en: No file records yet
zh_hant: 還沒有檔案記錄

source: 新的文件变动会自动出现在左侧列表。
en: New file changes will appear in the left list automatically.
zh_hant: 新的檔案變動會自動出現在左側列表。

source: 添加监控目录后，文件变动会被自动记录。
en: File changes will be recorded automatically after you add a monitored folder.
zh_hant: 新增監控目錄後，檔案變動會被自動記錄。

source: 选择一条记录
en: Select a Record
zh_hant: 選擇一條記錄

source: 从左侧列表中选择文件变动后，可查看路径、状态并执行同步操作。
en: Select a file change on the left to view its path, status, and sync actions.
zh_hant: 從左側列表中選擇檔案變動後，可查看路徑、狀態並執行同步操作。

source: 同步到 IMA
en: Sync to IMA

source: 仅标记完成
en: Mark Done Only
zh_hant: 僅標記完成

source: 浅色
en: Light
zh_hant: 淺色

source: 深色
en: Dark

source: 记录
en: Records
zh_hant: 記錄

source: 已完成
en: Done

source: 原路径
en: Original Path
zh_hant: 原路徑

source: 重新标记待同步
en: Mark Pending Again
zh_hant: 重新標記待同步

source: 在 Finder 中显示
en: Show in Finder
zh_hant: 在 Finder 中顯示

source: 变动
en: Change
zh_hant: 變動

source: 监控文件夹
en: Monitored Folder
zh_hant: 監控資料夾

source: 尚未添加目录
en: No folder added yet
zh_hant: 尚未新增目錄

source: 添加
en: Add
zh_hant: 新增

source: 添加更多目录
en: Add More Folders
zh_hant: 新增更多目錄

source: 继续监控其他文件夹
en: Continue monitoring other folders.
zh_hant: 繼續監控其他資料夾

source: 启用默认忽略规则
en: Enable Default Ignore Rules
zh_hant: 啟用預設忽略規則

source: 忽略文件名
en: Ignored File Names
zh_hant: 忽略檔案名稱

source: 用逗号、分号或换行分隔，例如 .DS_Store, debug.log
en: Separate with commas, semicolons, or new lines, such as .DS_Store, debug.log.
zh_hant: 用逗號、分號或換行分隔，例如 .DS_Store, debug.log

source: 忽略后缀
en: Ignored Extensions
zh_hant: 忽略副檔名

source: 用逗号、分号或换行分隔，例如 .log, .tmp
en: Separate with commas, semicolons, or new lines, such as .log, .tmp.
zh_hant: 用逗號、分號或換行分隔，例如 .log, .tmp

source: 忽略目录名
en: Ignored Folder Names
zh_hant: 忽略目錄名稱

source: 用逗号、分号或换行分隔，例如 node_modules, DerivedData
en: Separate with commas, semicolons, or new lines, such as node_modules, DerivedData.
zh_hant: 用逗號、分號或換行分隔，例如 node_modules, DerivedData

source: 恢复默认
en: Restore Defaults
zh_hant: 恢復預設

source: 清空自定义规则，并重新启用默认忽略规则
en: Clear custom rules and re-enable the default ignore rules.
zh_hant: 清空自訂規則，並重新啟用預設忽略規則

source: 恢复
en: Restore
zh_hant: 恢復

source: 同步
en: Sync

source: 自动同步：文件稳定 30 秒后上传到云端
en: Auto sync: upload to the cloud after files stay stable for 30 seconds.
zh_hant: 自動同步：檔案穩定 30 秒後上傳到雲端

source: 手动同步：点击同步按钮时上传
en: Manual sync: upload only when you click a sync button.
zh_hant: 手動同步：點擊同步按鈕時上傳

source: 连接状态
en: Connection Status
zh_hant: 連線狀態

source: 查看请求日志
en: View Request Logs
zh_hant: 查看請求日誌

source: 允许消息通知
en: Allow Notifications
zh_hant: 允許訊息通知

source: 新文件变动时发送系统通知
en: Send a system notification when files change.
zh_hant: 新檔案變動時發送系統通知

source: 默认导出格式
en: Default Export Format
zh_hant: 預設匯出格式

source: 报告与记录导出的默认格式
en: Default format for report and record exports.
zh_hant: 報告與記錄匯出的預設格式

source: 已同步记录保留
en: Synced Record Retention
zh_hant: 已同步記錄保留

source: 未同步记录不会自动清理
en: Unsynced records are never cleaned up automatically.
zh_hant: 未同步記錄不會自動清理

source: 30 天
en: 30 days

source: 90 天
en: 90 days

source: 365 天
en: 365 days

source: 已激活
en: Activated
zh_hant: 已啟用

source: 未测试
en: Not Tested
zh_hant: 未測試

source: 检查当前凭据是否可用
en: Check whether the current credentials are valid.
zh_hant: 檢查目前憑證是否可用

source: 刷新云端知识库列表
en: Refresh cloud knowledge bases
zh_hant: 重新整理雲端知識庫列表

source: 打开待同步文件
en: Open Pending Files
zh_hant: 開啟待同步檔案

source: 设置...
en: Settings...
zh_hant: 設定...

# 条待同步_format
source: %d 条待同步
en: %d pending
zh_hant: %d 條待同步

# 个待处理_format
source: %d 个待处理
en: %d pending
zh_hant: %d 個待處理

# 个文件待处理_format
source: %d 个文件待处理
en: %d files pending
zh_hant: %d 個檔案待處理

# 个目录_format
source: %d 个目录
en: %d folders
zh_hant: %d 個目錄

# 条_format
source: %d 条
en: %d records
zh_hant: %d 條

# 天_format
source: %d 天
en: %d days

# IMA OpenAPI 连接成功，已获取知识库_format
source: IMA OpenAPI 连接成功，已获取 %d 个知识库
en: IMA OpenAPI connected. %d knowledge bases found.
zh_hant: IMA OpenAPI 連線成功，已取得 %d 個知識庫

source: 批量标记完成已移到待同步页，首页只保留同步主操作。
en: Batch mark-as-done has moved to Pending; Home keeps only the primary sync action.
zh_hant: 批次標記完成已移至待同步頁，首頁只保留同步主操作。

source: 当前为自动同步：文件变动 30 秒后自动同步至云端
en: Auto sync is on: file changes upload to the cloud after 30 seconds.
zh_hant: 目前為自動同步：檔案變動 30 秒後自動同步至雲端

source: 当前为手动同步：需要点击全部同步或单条上传
en: Manual sync is on: click Sync All or upload a single item.
zh_hant: 目前為手動同步：需要點擊全部同步或單筆上傳

source: 更新
en: Update

source: 导出 CSV
en: Export CSV
zh_hant: 匯出 CSV

source: 导出 JSON
en: Export JSON
zh_hant: 匯出 JSON

source: 类型分布
en: Type Breakdown
zh_hant: 類型分佈

source: 按文件变动类型统计。
en: Grouped by file change type.
zh_hant: 按檔案變動類型統計。

source: 导出
en: Export
zh_hant: 匯出

source: 导出当前时间范围内的记录。
en: Export records in the current time range.
zh_hant: 匯出目前時間範圍內的記錄。

source: 当前范围内最新的文件变动。
en: Latest file changes in the current range.
zh_hant: 目前範圍內最新的檔案變動。

source: 这个时间范围还没有文件变动。
en: No file changes in this time range.
zh_hant: 這個時間範圍還沒有檔案變動。

source: 暂无日志记录
en: No Logs Yet
zh_hant: 暫無日誌記錄

source: 所有的 IMA 接口请求和响应详情都会记录在这里
en: All IMA request and response details are recorded here.
zh_hant: 所有 IMA 介面請求和回應詳情都會記錄在這裡

source: IMA 请求日志
en: IMA Request Logs
zh_hant: IMA 請求日誌

source: 关闭
en: Close
zh_hant: 關閉

source: 清空
en: Clear

source: 复制完整日志详情
en: Copy Full Log Details
zh_hant: 複製完整日誌詳情

source: 【IMA 请求日志】
en: [IMA Request Logs]
zh_hant: 【IMA 請求日誌】

source: 时间
en: Time
zh_hant: 時間

source: 方法
en: Method

source: 全路径
en: Full URL
zh_hant: 完整路徑

source: HTTP 状态
en: HTTP Status
zh_hant: HTTP 狀態

source: 复制此段内容
en: Copy this section
zh_hant: 複製此段內容

source: 检测到文件改动
en: File Change Detected
zh_hant: 偵測到檔案變動

source: 创建
en: Created
zh_hant: 建立

source: 智能状态合并
en: Intelligent State Merging
zh_hant: 智能狀態合并

source: 系统会自动合并同一文件的多次连续操作。例如「新建后编辑」仍记为新建，「多次编辑」仅保留最新修改，从而大幅减少同步冗余。
en: Operations on the same file are merged automatically. For example, 'Edit after Create' remains as a creation, and multiple edits keep only the latest modification, reducing sync redundancy.
zh_hant: 系統會自動合并同一文件的多次連續操作。例如「新建後編輯」仍記为新建，「多次編輯」僅保留最新修改，从而大幅减少同步冗余。

source: 作者：
en: Author:

source: 暂无可同步
en: Nothing to Sync
zh_hant: 暫無可同步

source: 状态摘要
en: Status Summary
zh_hant: 狀態摘要

source: 当前模式
en: Mode
zh_hant: 當前模式

source: 监控路径
en: Monitored Paths
zh_hant: 監控路徑

# 个文件_format
source: %d 个文件
en: %d files
zh_hant: %d 個文件

# 个_format
source: %d 个
en: %d total
zh_hant: %d 個

source: 确认删除记录？
en: Delete record?
zh_hant: 確認刪除記錄？

source: 该操作不可恢复，仅删除 App 内的变动记录，不会影响实际文件。
en: This action cannot be undone. It only removes the record from the app and does not affect your actual files.
zh_hant: 該操作不可恢復，僅刪除 App 內的變動記錄，不會影响實際文件。

source: 确认删除
en: Confirm Delete
zh_hant: 確認刪除

source: 删除记录
en: Delete Record
zh_hant: 刪除記錄

source: 确认批量删除 %d 条记录？
en: Delete %d records?
zh_hant: 確認批量刪除 %d 條記錄？

source: 该操作将删除当前视图下显示的所有记录。该操作不可恢复。
en: This will delete all records currently shown in this view. This action cannot be undone.
zh_hant: 該操作將刪除當前視窗下顯示的所有記錄。該操作不可恢復。

source: 确认批量删除
en: Confirm Batch Delete
zh_hant: 確認批量刪除

source: 批量删除当前视图记录
en: Batch delete current records
zh_hant: 批量刪除當前視窗記錄

source: 确认批量删除记录？
en: Delete multiple records?
zh_hant: 確認批量刪除記錄？

source: 即将删除当前显示的 %d 条记录。该操作不可恢复，且不会影响实际文件。
en: You are about to delete the %d records currently shown. This action cannot be undone and will not affect your actual files.
zh_hant: 即將刪除當前顯示的 %d 條記錄。該操作不可恢復，且不會影响實際文件。

source: 批量删除
en: Batch Delete
zh_hant: 批量刪除

source: 欢迎使用
en: Welcome
zh_hant: 歡迎使用

source: 按功能场景查看 FileSyncMonitor 的监控、同步、导出与设置能力。
en: Explore FileSyncMonitor by workflow: monitoring, sync, export, and settings.
zh_hant: 按功能場景查看 FileSyncMonitor 的監控、同步、匯出與設定能力。

source: 清新、轻量、面向日常同步工作流。
en: Fresh, lightweight, and built for everyday sync workflows.
zh_hant: 清新、輕量、面向日常同步工作流。

source: 本工具用于监控本地文件变动，并辅助同步到 IMA 云端。
en: This tool monitors local file changes and helps sync them to IMA Cloud.
zh_hant: 本工具用於監控本地檔案變動，並輔助同步到 IMA 雲端。

source: 监控与过滤
en: Monitoring & Filtering
zh_hant: 監控與過濾

source: 从选择目录到过滤噪声文件，保证记录列表干净可用。
en: From folder selection to noise filtering, keep your records clean and useful.
zh_hant: 從選擇目錄到過濾雜訊檔案，保證記錄列表乾淨可用。

source: 添加监控目录
en: Add Monitored Folders
zh_hant: 新增監控目錄

source: 在首页或设置中添加文件夹，应用会保存授权并在下次启动后继续监控。
en: Add folders from Home or Settings. The app saves permission and keeps monitoring after restart.
zh_hant: 在首頁或設定中新增資料夾，應用會保存授權並在下次啟動後繼續監控。

source: 实时捕获变动
en: Capture Changes in Real Time
zh_hant: 即時捕獲變動

source: 通过 macOS FSEvents 捕获新增、修改、删除和重命名，变动会自动进入记录列表。
en: Uses macOS FSEvents to capture created, modified, deleted, and renamed files automatically.
zh_hant: 透過 macOS FSEvents 捕獲新增、修改、刪除和重新命名，變動會自動進入記錄列表。

source: 默认忽略规则
en: Default Ignore Rules
zh_hant: 預設忽略規則

source: 默认过滤 .DS_Store、临时文件、系统目录、构建产物和常见缓存目录。
en: Filters .DS_Store, temporary files, system folders, build outputs, and common caches by default.
zh_hant: 預設過濾 .DS_Store、暫存檔、系統目錄、建置產物和常見快取目錄。

source: 自定义忽略项
en: Custom Ignore Items
zh_hant: 自訂忽略項

source: 可在设置中维护忽略文件名、后缀和目录名，让监控范围更贴合你的项目。
en: Maintain ignored file names, extensions, and folder names in Settings to fit each project.
zh_hant: 可在設定中維護忽略檔名、副檔名和目錄名，讓監控範圍更貼合你的專案。

source: 记录处理
en: Record Handling
zh_hant: 記錄處理

source: 围绕待同步和全部记录进行查看、筛选、确认与清理。
en: Review, filter, confirm, and clean up Pending and All Records.
zh_hant: 圍繞待同步和全部記錄進行查看、篩選、確認與清理。

source: 待同步队列
en: Pending Queue
zh_hant: 待同步佇列

source: 左侧第二个入口集中展示未处理变动，可搜索路径、按类型筛选并批量处理。
en: The second rail item lists unhandled changes with path search, type filters, and batch actions.
zh_hant: 左側第二個入口集中展示未處理變動，可搜尋路徑、按類型篩選並批次處理。

source: 全部记录视图
en: All Records View
zh_hant: 全部記錄視圖

source: 保留所有已同步和未同步记录，适合回溯历史、查找文件变动轨迹。
en: Keeps synced and unsynced records for history review and change tracing.
zh_hant: 保留所有已同步和未同步記錄，適合回溯歷史、查找檔案變動軌跡。

source: 列表与树状模式
en: List & Tree Modes
zh_hant: 列表與樹狀模式

source: 二级侧栏支持列表和树状视图切换，既能快速扫列表，也能按目录结构定位。
en: The secondary sidebar switches between list and tree views for scanning or folder-based navigation.
zh_hant: 二級側欄支援列表和樹狀視圖切換，既能快速掃列表，也能按目錄結構定位。

source: 详情与快捷操作
en: Details & Quick Actions
zh_hant: 詳情與快捷操作

source: 选中记录后可查看路径、时间、状态，并执行同步、标记完成、Finder 显示或删除记录。
en: Select a record to view path, time, status, and run sync, mark done, show in Finder, or delete.
zh_hant: 選中記錄後可查看路徑、時間、狀態，並執行同步、標記完成、Finder 顯示或刪除記錄。

source: 批量删除记录
en: Batch Delete Records
zh_hant: 批次刪除記錄

source: 在待同步或全部记录页可清理当前筛选结果，只删除应用内记录，不影响真实文件。
en: Clean the current filtered result in Pending or All Records. This only removes app records, not real files.
zh_hant: 在待同步或全部記錄頁可清理目前篩選結果，只刪除應用內記錄，不影響真實檔案。

source: IMA 云端同步
en: IMA Cloud Sync
zh_hant: IMA 雲端同步

source: 支持手动上传、自动上传、知识库绑定和云端拉取。
en: Supports manual upload, auto upload, knowledge-base binding, and cloud pull.
zh_hant: 支援手動上傳、自動上傳、知識庫綁定和雲端拉取。

source: 默认采用手动模式，点击单条“同步到 IMA”或首页“全部同步”后再上传。
en: Manual mode is the default. Upload by clicking Sync to IMA on one item or Sync All on Home.
zh_hant: 預設採用手動模式，點擊單筆「同步到 IMA」或首頁「全部同步」後再上傳。

source: 开启后，文件稳定 30 秒会自动上传，减少频繁保存造成的重复同步。
en: When enabled, files upload after staying stable for 30 seconds, reducing duplicate syncs.
zh_hant: 開啟後，檔案穩定 30 秒會自動上傳，減少頻繁保存造成的重複同步。

source: 目录绑定知识库
en: Bind Folders to Knowledge Bases
zh_hant: 目錄綁定知識庫

source: 每个监控目录都可以绑定不同 IMA 知识库；不绑定时默认导入为新笔记。
en: Each monitored folder can bind to a different IMA knowledge base; unbound folders import as new notes.
zh_hant: 每個監控目錄都可以綁定不同 IMA 知識庫；不綁定時預設匯入為新筆記。

source: 待同步页可从 IMA 拉取云端新增内容，并下载到对应本地目录。
en: The Pending page can pull new IMA cloud content and download it to the matching local folder.
zh_hant: 待同步頁可從 IMA 拉取雲端新增內容，並下載到對應本地目錄。

source: 删除事件同步提示
en: Deletion Sync Notice
zh_hant: 刪除事件同步提示

source: 本地删除会在应用内标记已同步；由于 IMA 未开放云端删除 API，云端文档需手动清理。
en: Local deletions are marked synced in the app. Since IMA has no cloud delete API, cloud documents require manual cleanup.
zh_hant: 本地刪除會在應用內標記已同步；由於 IMA 未開放雲端刪除 API，雲端文件需手動清理。

source: 请求日志排查
en: Request Log Troubleshooting
zh_hant: 請求日誌排查

source: 连接测试和同步请求会记录在 IMA 请求日志中，方便排查凭据、接口和网络问题。
en: Connection tests and sync requests are recorded in IMA logs for credential, API, and network debugging.
zh_hant: 連線測試和同步請求會記錄在 IMA 請求日誌中，方便排查憑證、介面和網路問題。

source: 报告、通知与菜单栏
en: Reports, Notifications & Menu Bar
zh_hant: 報告、通知與選單列

source: 把同步状态从主窗口延伸到菜单栏、通知和导出文件。
en: Extend sync status from the main window to the menu bar, notifications, and export files.
zh_hant: 把同步狀態從主視窗延伸到選單列、通知和匯出檔案。

source: 统计报告
en: Statistics Reports
zh_hant: 統計報告

source: 报告页按今天、近 7 天、近 30 天或全部范围统计记录、待同步和已完成数量。
en: Reports summarize records, pending items, and completed items for Today, 7 days, 30 days, or All.
zh_hant: 報告頁按今天、近 7 天、近 30 天或全部範圍統計記錄、待同步和已完成數量。

source: CSV / JSON 导出
en: CSV / JSON Export
zh_hant: CSV / JSON 匯出

source: 可导出当前记录或报告范围，便于留档、分析或给其他工具继续处理。
en: Export current records or report ranges for archiving, analysis, or other tools.
zh_hant: 可匯出目前記錄或報告範圍，便於留檔、分析或給其他工具繼續處理。

source: 系统通知提醒
en: System Notifications
zh_hant: 系統通知提醒

source: 新文件变动出现时可发送 macOS 通知，避免待同步事项被遗忘。
en: Send macOS notifications when file changes appear so pending work is not missed.
zh_hant: 新檔案變動出現時可發送 macOS 通知，避免待同步事項被遺忘。

source: 菜单栏状态
en: Menu Bar Status
zh_hant: 選單列狀態

source: 菜单栏图标会显示待同步数量，可快速打开窗口、标记完成或退出应用。
en: The menu bar icon shows pending count and lets you open the window, mark done, or quit.
zh_hant: 選單列圖示會顯示待同步數量，可快速開啟視窗、標記完成或退出應用。

source: 设置与体验
en: Settings & Experience
zh_hant: 設定與體驗

source: 让界面语言、外观、凭据与高级能力保持可控。
en: Keep language, appearance, credentials, and pro capabilities under control.
zh_hant: 讓介面語言、外觀、憑證與高級能力保持可控。

source: 多语言界面
en: Multilingual UI
zh_hant: 多語言介面

source: 支持跟随系统、English、简体中文和繁体中文，切换后主界面和菜单栏同步刷新。
en: Supports System, English, Simplified Chinese, and Traditional Chinese; the main UI and menu bar refresh together.
zh_hant: 支援跟隨系統、English、簡體中文和繁體中文，切換後主介面和選單列同步刷新。

source: 浅色与深色模式
en: Light & Dark Modes
zh_hant: 淺色與深色模式

source: 可跟随系统，也可手动选择浅色或深色，整体保持清新简约风格。
en: Follow the system or manually choose light or dark while keeping the interface clean and fresh.
zh_hant: 可跟隨系統，也可手動選擇淺色或深色，整體保持清新簡約風格。

source: 凭据输入与复制粘贴
en: Credential Editing & Paste
zh_hant: 憑證輸入與複製貼上

source: Client ID 和 API Key 支持键盘输入、复制、粘贴与隐藏显示。
en: Client ID and API Key support keyboard input, copy, paste, and reveal/hide.
zh_hant: Client ID 和 API Key 支援鍵盤輸入、複製、貼上與隱藏顯示。

source: 引导进度_format
en: Step %d of %d
zh_hant: 第 %d / %d 步

source: 跳过
en: Skip
zh_hant: 跳過

source: 上一步
en: Back

source: 下一步
en: Next

source: 完成
en: Done

source: 先认识左侧导航
en: Start with the left navigation
zh_hant: 先認識左側導航

source: 左侧图标栏是主要入口：首页、待同步、全部记录、报告、帮助和设置都在这里切换。
en: The left icon rail is your main navigation: Home, Pending, All Records, Reports, Help, and Settings.
zh_hant: 左側圖示欄是主要入口：首頁、待同步、全部記錄、報告、幫助和設定都在這裡切換。

source: 第一步：添加监控目录
en: Step 1: Add a monitored folder
zh_hant: 第一步：新增監控目錄

source: 点击“添加目录”选择你要关注的文件夹。授权后，文件新增、修改、删除和重命名都会被自动记录。
en: Click “Add Folder” and choose a folder to watch. After permission is granted, created, modified, deleted, and renamed files are recorded automatically.
zh_hant: 點擊「新增目錄」選擇你要關注的資料夾。授權後，檔案新增、修改、刪除和重新命名都會被自動記錄。

source: 选择手动或自动同步
en: Choose manual or auto sync
zh_hant: 選擇手動或自動同步

source: 默认是手动同步。开启自动同步后，文件稳定 30 秒会自动上传到 IMA，适合持续写作或频繁保存的目录。
en: Manual sync is the default. Turn on auto sync and files upload to IMA after staying stable for 30 seconds, which is useful for frequent saves.
zh_hant: 預設是手動同步。開啟自動同步後，檔案穩定 30 秒會自動上傳到 IMA，適合持續寫作或頻繁保存的目錄。

source: 处理待同步与历史记录
en: Handle pending and history
zh_hant: 處理待同步與歷史記錄
